var mongoose = require("mongoose");
var Poem     = require("./models/poem");

function seedDB(){
	Poem.remove({}, function(err){
		if(err){
			console.log(err);
		}else{
			console.log("DB refreshed successfully!!");
			//on deletion, add the starter poem
			Poem.create({
				title: "আন্দামান",
				body:  "৬৪৯৬ বর্গ কিলোমিটার বিস্তৃত,রহস্যময়ী আন্দামান\r\nঅতি বিস্ময়ে! জ্ঞানত শুনেছি,শুধুই তোমার জয়গান\r\nজগৎ বিখ্যাত,প্রাণ উচ্ছল,সবুজ দ্বীপের রাজা তুমি\r\nনীল সাগরে,চারি দিক ঘেরা, অতুলনীয় স্বতন্ত্র ভূমি\r\n\r\nকষ্টকর জলপথ ছেড়ে,আকাশপথে এরোপ্লেনে উড়ে\r\nবঙ্গোপসাগরের কোলে, উল্লাসে,এলাম তোমার ঘরে\r\nপ্রকৃতি দেখি সৌন্দর্যের ডালি ,দিয়েছে উজাড় করে\r\nস্বর্গ মর্তের ভেদাভেদ ভুলে , দেখলাম দুই চোখ ভরে\r\n\r\nনীল আকাশ , দিগন্তে বিস্তারিত নীলাভ জলরাশি\r\nনৈসর্গিক অনুভূতি ,স্বপ্নিল দেশ ,সপ্তসুরে বাজে বাঁশি\r\nঅনুপম, অবিশ্বাস্য , নিরবিচ্ছিন্ন , বৈচিত্র্যময় জীবন\r\nরাজপথে কল্লোলিত, সহজ সরল,শৃঙ্খলিত জনগণ\r\n\r\nকালাপানি! কোথায় তুমি ? খুঁজি তোমায় বারবার\r\nসেলুলার জেলের ,কালো ছায়ায়, করলাম আবিষ্কার\r\nসমুদ্রের ,নীল -জলে,কালো রাত্রির ,কালো প্রতিচ্ছবি\r\n শহীদদের! নামকরণ,জীবনে ওঁদের উঠেনি তখন রবি\r\n\r\n৯'/১৫' মাপের, ৬৮০টি কুঠরি বিশিষ্ট সেলুলার জেল\r\nশিহরিত দেখে, ইংরেজদের, নির্মম অত্যাচারের খেল\r\nটর্চাররুম,নুন ছাড়া ভাতের ফেন,সারাদিন ঘানিটানা\r\nলক্ষমাত্রার নারকেল তেল নাপেলে চাবুক ছিল পাওনা\r\n\r\nফাঁসিরঘরে একত্রে ছিল, তিন জনের ফাঁসির কৌশল\r\nতবুও পারেনি ভাঙতে ,স্বাধীনতা সংগ্রামীর মনোবল\r\nঅশ্রুসিক্ত ভারাক্রান্ত মনে, দেখি শহীদদের বলিদান\r\nনেমকহারাম জাতি! পারিনি দিতে,ঐ রক্তের প্রতিদান\r\n\r\nরসস্মিথ,হ্যাভলক,নীল আইল্যান্ড ,অতি মনোহর দৃশ্য\r\nসাত রঙে রাঙা স্বচ্ছ জলে , দেখি সামুদ্রিক বৈচিত্র্য\r\nকোরাল, প্রবাল, মৎস্য, ম্যানগ্রোভ, নির্মল বেলাভূমি\r\nদশদিকে দেখি আপন গরিমায় ,বিরাজ করছো তুমি\r\n\r\n৪৫ কিমি বিস্তৃত জিরকাট্যাং'জারোয়া রিজার্ভ ফরেস্ট'\r\nসবুজ বাগিচায় কৃষ্ণ মানব , মধ্যাহ্নে নিচ্ছে রেস্ট\r\nঘনবনে, রোমাঞ্চিত,শিহরিত, দেখে প্রথম মানব কূল\r\nপ্রকৃতির কোলে লালিত পালিত যেন কালো গোলাপ ফুল\r\n\r\nসূর্যোদয়-সূর্যাস্তের ,অবর্ণনীয়, রঙিন মায়াবী পরিবেশ\r\nডাবের জলের অমৃত সুধা, চিরদিন তার থাকবে রেশ\r\nআন্দামান তোমায়, শব্দ চয়নে বাঁধা ,অতি দুরূহ কাজ\r\সর্বদা তুমি বিরাজ করো,হয়ে আমাদের হৃদয়ের রাজ।"
				}, function(err, poem){
				if(err){
					console.log(err);
				}else{
					console.log("Data added successfully!!!");
				}
			});
		}
	});
}

module.exports = seedDB;